       IDENTIFICATION      DIVISION.
       PROGRAM-ID.         VALIDATE.
       AUTHOR.             JOAO FERNANDES.
       DATE-WRITTEN.       19/08/2026.
       DATE-COMPILED.      19/08/2026.

       ENVIRONMENT         DIVISION.
       CONFIGURATION       SECTION.
       SPECIAL-NAMES.
         DECIMAL-POINT     IS COMMA.

       INPUT-OUTPUT        SECTION.
       FILE-CONTROL.
         SELECT EARQ-EMP 
           ASSIGN TO ".\DATAS\EARQ_EMPLOYEES.DAT"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-EARQ-EMP.

         SELECT EARQ-MOVES 
           ASSIGN TO ".\DATAS\EARQ_MOVES.DAT"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-EARQ-MOVES.

         SELECT SARQ-REJECTED-REG 
           ASSIGN TO ".\SARQ_REJECTED_REG.TXT"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-SARQ-REJECTED-REG.

         SELECT SARQ-VALIDATED-EMP
           ASSIGN TO ".\SARQ_VALIDATED_EMP.DAT"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-SARQ-VALIDATED-EMP.

       DATA                DIVISION.
       FILE                SECTION.
      * LAYOUT IS 92 POSITIONS
         FD EARQ-EMP.
           COPY ".\BOOKS\MASTER_EMP".
      * LAYOUT IS 19 POSITIONS
         FD EARQ-MOVES.
           COPY ".\BOOKS\MOVES".
      * LAYOUT IS 67
         FD SARQ-REJECTED-REG.
           COPY ".\BOOKS\REJECTED_EMP".
      * LAYOUT IS 92 POSITIONS
         FD SARQ-VALIDATED-EMP.
           COPY ".\BOOKS\VALIDATED_EMP".

       WORKING-STORAGE     SECTION.
      * FILE STATUS VARIABLES
       01 FS-EARQ-EMP              PIC 9(02).
       01 FS-EARQ-MOVES            PIC 9(02).
       01 FS-SARQ-REJECTED-REG     PIC 9(02).
       01 FS-SARQ-VALIDATED-EMP    PIC 9(02).

       01 WS-END-EARQ-EMP          PIC X(01).
         88 END-EARQ-EMP           VALUE 'Y'.
         88 NOT-END-EARQ-EMP       VALUE 'N'.
       
       01 WS-ERR-DESC              PIC A(30) VALUES SPACES.
       01 WS-ERR-STATUS            PIC 9(02) VALUE ZERO.
       PROCEDURE           DIVISION.
       0100-MAIN           SECTION.
           PERFORM 0200-INIT.
           PERFORM 0300-PROCESS.
           PERFORM 0400-FINALIZER.
           GOBACK.
       0100-END.           EXIT.
       0200-INIT           SECTION.
           OPEN INPUT EARQ-EMP.
           OPEN INPUT EARQ-MOVES.

           IF FS-EARQ-EMP NOT EQUALS ZERO
               MOVE "MASTER EMPLOYEES FILE" TO WS-ERR-DESC
               MOVE FS-EARQ-EMP             TO WS-ERR-STATUS
               PERFORM 0210-INIT-FAIL
           END-IF
           
           IF FS-EARQ-MOVES NOT EQUALS ZERO
               MOVE "MOVES FOR EMPLOYEES FILE" TO WS-ERR-DESC
               MOVE FS-EARQ-MOVES              TO WS-ERR-STATUS
               PERFORM 0210-INIT-FAIL
           END-IF.
       0200-END.           EXIT.
       0210-INIT-FAIL      SECTION.
           DISPLAY "* ERROR"
           DISPLAY "** COULD NOT OPEN " WS-ERR-DESC
           DISPLAY "** STATUS CODE WAS " WS-ERR-STATUS
           PERFORM 0400-FINALIZER
           GOBACK.
       0210-END.           EXIT.
       0300-PROCESS        SECTION.
           PERFORM UNTIL END-EARQ-EMP
             READ EARQ-EMP
               AT END SET END-EARQ-EMP TO TRUE
               NOT AT END DISPLAY REG-EMPLOYEE
           END-PERFORM.
       0300-END.           EXIT.
       0400-FINALIZER      SECTION.
           CLOSE EARQ-EMP EARQ-MOVES.
       0400-END.           EXIT.
