       IDENTIFICATION      DIVISION.
       PROGRAM-ID.         VALIDATE.
       AUTHOR.             JOAO FERNANDES.
       DATE-WRITTEN.       19/08/2026.
       DATE-COMPILED.      19/08/2026.

       ENVIRONMENT         DIVISION.
       CONFIGURATION       SECTION.
       SPECIAL-NAMES.
         DECIMAL-POINT     IS COMMA.

       INPUT-OUTPUT        SECTION.
       FILE-CONTROL.
         SELECT EARQ-EMP 
           ASSIGN TO ".\DATAS\EARQ_EMPLOYEES.DAT"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-EARQ-EMP.

      *   SELECT SARQ-REJECTED-REG 
      *     ASSIGN TO ".\SARQ_REJECTED_REG.TXT"
      *     ORGANIZATION IS LINE SEQUENTIAL
      *     FILE STATUS IS FS-SARQ-REJECTED-REG.

      *   SELECT SARQ-VALIDATED-EMP 
      *     ASSIGN TO ".\SARQ_VALIDATED_EMP.DAT"
      *     ORGANIZATION IS LINE SEQUENTIAL
      *     FILE STATUS IS FS-SARQ-VALIDATED-EMP.

       DATA                DIVISION.
       FILE                SECTION.
         FD EARQ-EMP.
           COPY ".\BOOKS\MASTER_EMP".
       WORKING-STORAGE     SECTION.
      * FILE STATUS VARIABLES
       01 FS-EARQ-EMP           PIC 9(02).
       01 FS-SARQ-REJECTED-REG  PIC 9(02).
       01 FS-SARQ-VALIDATED-EMP PIC 9(02).

       PROCEDURE           DIVISION.
           DISPLAY "ALO".
           STOP RUN.
