       01  REG-MOVIMENTO.
         05  MOV-ID            PIC 9(6).
         05  MOV-WORK-HOURS    PIC 9(3)V99.
         05  MOV-OVERTIME      PIC 9(3)V99.
         05  MOV-ABSENTS       PIC 9(2).
         05  MOV-BONUS         PIC 9(5)V99 COMP-3.
